app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("created_at", "director", "length", "studio", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-11-13 22:12:52.866790"], ["director", "George Lucas"], ["length", 121], ["studio", "Fox"], ["title", "star wars"], ["updated_at", "2014-11-13 22:12:52.866790"]]

  def update
    respond_to do |format|
      if @movie.update(movie_params)
---
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = 1  [["title", "Star Wars"], ["updated_at", "2014-11-13 22:15:47.670366"]]